[
  {
    "id": 1,
    "name": "Keepr (Coming Soon)",
    "about": [
      {
        "description": "I am architecting and building Keepr, a comprehensive SaaS platform designed to streamline sports league management. This project involves developing both a feature-rich admin dashboard (team/player management, registration processing, scheduling) and a player-facing personalized league website",
        "tech": "Built with React, Next.js, and Tailwind CSS for the frontend. Backend powered by Laravel (PHP) with PostgreSQL database. Features include Stripe payment processing, SMS/email notifications, and tournament scheduling tools. Containerized with Docker and deployed on AWS."
      }
    ],
    "technologies": [
      "Typescript",
      "Next.js",
      "Tailwind",
      "TanStack Query",
      "PHP",
      "Laravel",
      "Postgres",
      "AWS",
      "Stripe"
    ],
    "picture": "https://res.cloudinary.com/dwshqssez/image/upload/v1745037554/image_lrv8ee.png",
    "github": null,
    "liveLink": null
  },
  {
    "id": 2,
    "name": "SocialConnect",
    "about": [
      {
        "description": "A Web Application intended to look and operate in a similar fashion to Facebook. Users can create an account, post, comment and add friends. Along with other features this project was intended to provide the same feel one would get using Facebook.",
        "tech": "The client side was built with React, and Redux to handle state. Axios was used to to make the necessary API calls to our server side which was built using Express. For data handling MongoDB Atlas was used as well as Cloudinary for image uploading."
      }
    ],
    "technologies": [
      "Node",
      "Express",
      "MongoDB",
      "Javascript",
      "CSS",
      "React",
      "Redux",
      "Socket.IO"
    ],
    "picture": "https://res.cloudinary.com/dwshqssez/image/upload/v1646260027/qun5caffybrxwgpwu9gd.jpg",
    "github": "https://github.com/Nuccino92/facebook-clone",
    "liveLink": "https://mock-portfolio-project-socialconnect.netlify.app/"
  },
  {
    "id": 3,
    "name": "ChatApp",
    "about": [
      {
        "description": "ChatApp allows users to create an account and connect with friends. Using web Socket.IO the app allows users to have real time conversations similar to other applications like WhatsApp.",
        "tech": "The applications client side was build with React and Redux, with Axios used to make API calls to the server side which was build with Express. All data is managed by ClearDB MySQL using Sequelize."
      }
    ],
    "technologies": [
      "Node",
      "Express",
      "MySQL",
      "Javascript",
      "CSS",
      "React",
      "Redux",
      "Socket.IO"
    ],
    "picture": "https://res.cloudinary.com/dwshqssez/image/upload/v1745029816/image_jsi2pu.png",
    "github": "https://github.com/Nuccino92/chat-app",
    "liveLink": "https://superfun-chat-app.netlify.app/"
  }
]
